import { Component } from '@angular/core';

@Component({
  selector: 'app-our-projects-section',
  templateUrl: './our-projects-section.component.html',
  styleUrls: ['./our-projects-section.component.scss']
})
export class OurProjectsSectionComponent {

  projects = [
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
    {
      name: 'الأعمال الخارجية',
      image: 'assets/imgs/bgslide2.jpg',
      description: 'تشمل هذه الأعمال إنشاء وتصميم المباني السكنية والتجارية بمختلف المستويات والأحجام، بدءًا من الفيلات وصولاً إلى المجمعات التجارية والمراكز التجارية.',
    },
  ]

}
