import { Component } from '@angular/core';

@Component({
  selector: 'app-testmonial-section',
  templateUrl: './testmonial-section.component.html',
  styleUrls: ['./testmonial-section.component.scss']
})
export class TestmonialSectionComponent {

  testmonials = [
    {
      description: 'بفضل التخطيط الدقيق وإدارة المشاريع الفعالة، نحن قادرون على تحقيق الأهداف في الوقت المحدد وداخل الميزانية المحددة. نحن نستخدم أحدث التقنيات والأدوات لتحسين الكفاءة وتحقيق أداء متفوق.',
      job: 'المدير التنفيذي'
    },
    {
      description: 'بفضل التخطيط الدقيق وإدارة المشاريع الفعالة، نحن قادرون على تحقيق الأهداف في الوقت المحدد وداخل الميزانية المحددة. نحن نستخدم أحدث التقنيات والأدوات لتحسين الكفاءة وتحقيق أداء متفوق.',
      job: 'المدير التنفيذي'
    },
    {
      description: 'بفضل التخطيط الدقيق وإدارة المشاريع الفعالة، نحن قادرون على تحقيق الأهداف في الوقت المحدد وداخل الميزانية المحددة. نحن نستخدم أحدث التقنيات والأدوات لتحسين الكفاءة وتحقيق أداء متفوق.',
      job: 'المدير التنفيذي'
    },
  ]

}
