import { Component } from '@angular/core';

@Component({
  selector: 'app-why-us-section',
  templateUrl: './why-us-section.component.html',
  styleUrls: ['./why-us-section.component.scss']
})
export class WhyUsSectionComponent {

  whyUsData = [
    {
      icon: 'fa-solid fa-award',
      title: 'خبرة وكفاءة',
      description: 'نحن نضم فريقًا محترفًا ومؤهلاً من المهندسين والمدراء والفنيين ذوي الخبرة الواسعة في مجال المقاولات العامة. نحن نستخدم أحدث التقنيات والممارسات البنائية لتنفيذ المشاريع بكفاءة عالية وفي الوقت المحدد.'
    },
    {
      icon: 'fa-solid fa-gem',
      title: 'الالتزام بالموثوقية',
      description: 'نحن نتعامل مع عملائنا بنزاهة وموثوقية. نحن نلتزم بالوفاء بالتزاماتنا وبتقديم نتائج موثوقة ومتفق عليها. نحن نعمل على بناء علاقات دائمة مع عملائنا بناءً على الثقة والكفاءة.'
    },
    {
      icon: 'fa-solid fa-circle-check',
      title: 'الالتزام بالجودة',
      description: 'نحن نضع الجودة في قمة أولوياتنا. نحن نلتزم بمعايير الجودة العالية في جميع مراحل المشروع، بدءًا من التخطيط وحتى التسليم. نحن نعمل بجد لتحقيق أعلى مستويات الجودة والتفوق في كل مشروع نتعامل معه.'
    },
    {
      icon: 'fa-solid fa-ranking-star',
      title: 'الاداء المتميز',
      description: 'الأداء المتميز هو السمة الأساسية التي تميز شركتنا في صناعتها. نحن نسعى جاهدين لتحقيق أعلى مستويات الأداء والتفوق في جميع جوانب عملنا. نحن نلتزم بتقديم خدمات متميزة وذات جودة عالية، سواء في تنفيذ المشاريع أو تقديم الخدمات الاستشارية.'
    },
  ]

}